leetcode/26/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>26. Remove Duplicates from Sorted Array - enzo&#39;s note book</title>
  <meta charset="utf-8" />
  <meta name="author" content="enzo liu" />
  <meta name="description" content="leetcode" />
  <meta name="keywords" content="leetcode, ruby" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">

</head>

  <body class="container">
<header id="header">
    <body>
        <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
            <div class="container-fluid">
                <div class="navbar-header">
                    <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                        <span class="sr-only">Toggle navigation</span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                    </button>
                    <a class="navbar-brand" href="/">enzo&#39;s note book</a>
                </div>
                <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
                    <ul class="nav navbar-nav navbar-right">
                            <li class="active"><a href="/blog/">Blog</a></li>
                            <li class="active"><a href="/history/">History</a></li>
                            <li class="active"><a href="/leetcode/">Leetcode</a></li>
                        <li><a href="/tags/">Tags</a></li>
                        <li><a href="/about/">About</a></li>
                        <li><a href="https://github.com/Enzo-Liu">GitHub</a></li>
                        <li><a href="/rss.xml">RSS</a></li>
                    </ul>
                </div>
            </div>
        </nav>
    </body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row" style="padding-top: 70px">
        <div class="col-md-2"></div>
            <h1>26. Remove Duplicates from Sorted Array</h1>
            
<div id="outline-container-org7d621e2" class="outline-2">
<h2 id="org7d621e2">题目</h2>
<div class="outline-text-2" id="text-org7d621e2">
<p>
<a href="https://leetcode.com/problems/remove-duplicates-from-sorted-array/">链接</a>
</p>

<p class="verse">
Given a sorted array, remove the duplicates in place such that each element appear only once and return the new length.<br />
<br />
Do not allocate extra space for another array, you must do this in place with constant memory.<br />
<br />
For example,<br />
Given input array nums = [1,1,2],<br />
<br />
Your function should return length = 2, with the first two elements of nums being 1 and 2 respectively. It doesn't matter what you leave beyond the new length.<br />
</p>
</div>
</div>

<div id="outline-container-org82aebe3" class="outline-2">
<h2 id="org82aebe3">思路</h2>
<div class="outline-text-2" id="text-org82aebe3">
<blockquote>
<p>
数过去，和上一个数不一样就加1，得到总的计数就可以了。
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org457e3cb" class="outline-2">
<h2 id="org457e3cb">代码</h2>
<div class="outline-text-2" id="text-org457e3cb">
<div class="org-src-container">
<pre class="src src-ruby"># @param {Integer[]} nums
# @return {Integer}
def remove_duplicates(nums)
  if nums.empty? then return 0 end
  p,last = 0,nums.at(0)
  nums.each_with_index do |v,index|
    if index != 0 and v != last then
      p = p + 1
      last = nums[p] = v
    end
  end
  p + 1
end
</pre>
</div>
</div>
</div>

    </div>
</section>


    <div class="post-meta">
        <span title="post date" class="post-info">2016-03-01</span>
        <span title="last modification date" class="post-info">2016-03-01</span>
        <span title="tags" class="post-info"><a href="/tags/leetcode/">leetcode</a>, <a href="/tags/ruby/">ruby</a></span>
        <span title="author" class="post-info">enzo liu</span>
    </div>
<footer class="footer">
    <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
    <p>
        Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:liuenze6516 &lt;at&gt; gmail &lt;dot&gt; com">enzo liu</a>
        &nbsp;&nbsp;-&nbsp;&nbsp;
        Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
        <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
    </p>
</footer>

  </body>
</html>
